Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: In fact numbers stored in the native integer format may be stored either in the signed native form, or in the unsigned native form.
es: De hecho, los números almacenados en formato de entero nativo se pueden almacenar en forma nativa con signo o sin signo.

source: In fact, an identifier within such curlies is forced to be a string, as is any simple identifier within a hash subscript.
es: De hecho, cuando se escribe un identificador entre llaves, se le fuerza a ser una cadena, como cualquier identificador en un subíndice de hash.

source: In fact, text strings are never in any other format!
es: (de hecho, es el único formato de las cadenas de texto).

source: In fact, there's really no such thing as a global variable in Perl.
es: De hecho, en Perl no hay variables globales.

source: In fact, we'd rather you gave a copy to all your friends.
es: De hecho, nos gustaría que regalara una copia a todos sus amigos.

source: In fact, you can match on just about anything you could dream of by using more complex regular expressions.
es: De hecho, puede detectar coincidencias donde quiera con expresiones regulares más complejas.

source: In general though, we try to limit this list to books published in the past five years.
es: Sin embargo, en general intentaremos limitar esta lista a libros publicados en los últimos cinco años.

source: In general, conversion from one form to another is transparent.
es: En general, la conversión de un tipo a otro es transparente.

source: In general, C<use Module ()> is recommended over C<require Module>, because it determines module availability at compile time, not in the middle of your program's execution.
es: En general se recomienda usar C<use Module ()> en lugar de C<require Module>, ya que determina la disponibilidad del módulo en tiempo de compilación, y no durante la ejecución del programa.

source: In general, Perl programmers don't need to worry about the distinction.
es: En general, los programadores que usan Perl no tienen que preocuparse por esta distinción.

source: In general, Perl relies on whatever implementation of standard I/O a given operating system supplies, so the buffering characteristics of a Perl program on one machine may not exactly match those on another machine.
es: En general, Perl se basa en la implementación de E/S estándar proporcionada por un sistema operativo determinado, por lo que las características de almacenamiento en búfer de un programa Perl en una máquina pueden no coincidir exactamente con las de otra máquina.

source: In general, if something strange has gone wrong with your program and you're not sure where you should look for help, try the B<-w> switch first.
es: Si sucede algo raro con el programa y no está seguro de dónde debe buscar ayuda, pruebe primero el modificador B<-w>.

source: In general, lines in Perl do not need any form of continuation mark, because L</whitespace> (including newlines) is gleefully ignored.
es: En general, las líneas de código Perl no necesitan ningún tipo de marca de continuación, ya que el L</espacio en blanco> (incluidos los caracteres de nueva línea) se ignora alegremente.

source: In general, the benefit of a language is closely related to the skill of the people using that language.
es: En general, las ventajas que ofrece un lenguaje están muy relacionadas con la destreza de los usuarios del lenguaje.

source: In general, you want to use either the current stable release, or the stable release immediately prior to that one.
es: En general, conviene usar la versión estable actual o la versión estable inmediatamente anterior.

source: In many languages (not Perl), it's illegal to use reserved words to name anything else.
es: A diferencia de Perl, muchos lenguajes permiten usar palabras reservadas para designar otras cosas.

source: In many languages, formal arguments are always given individual names, but in Perl, the formal arguments are just the elements of an array.
es: En muchos lenguajes los argumentos formales siempre reciben nombres individuales, pero en Perl solo son los elementos de un array.

source: In modern Perl, calling methods this way is often considered bad practice and to be avoided.
es: En Perl moderno se considera de mal estilo llamar a los métodos de esta manera, por lo que debe evitarse.

source: In modern filesystems, you can actually give a file more than one name.
es: Los sistemas de archivos modernos permiten asignar varios nombres a un archivo.

source: In modern times, refers more often to the entire collection of Perl L<modules|/module> on your system.
es: En la actualidad suele usarse para hacer referencia al conjunto completo de L<módulos|/módulo> Perl del sistema.

source: In more modern times, named releases don't come as often, and as progress can be followed (nearly) instantly (with rsync, and since late 2008, git) patches between versions are no longer provided.
es: En tiempos recientes, las versiones con nombre ya no son tan frecuentes, y como se puede seguir el progreso de forma (casi) instantánea (con rsync, y con git desde finales de 2008), ya no se proporcionan parches entre versiones.

source: In networking, a L</process> that either advertises a L</service> or just hangs around at a known location and waits for L<clients|/client> who need service to get in touch with it.
es: En contexto de redes, un L</proceso> que anuncia un L</servicio> o que simplemente espera en una ubicación conocida a que los L<clientes|/cliente> que necesitan el servicio se pongan en contacto con él.

source: In networking, a L</process> that initiates contact with a L</server> process in order to exchange data and perhaps receive a service.
es: En contexto de redes, es un L</proceso> que inicia el contacto con un proceso de L</servidor> para intercambiar datos y, tal vez, recibir un servicio.

source: In networking, an agreed-upon way of sending messages back and forth so that neither correspondent will get too confused.
es: En contexto de redes, una forma acordada de enviar mensajes de forma que ninguno de los interlocutores se confunda.

source: In networking, the same kind of temporary circuit between a L</client> and a L</server>.
es: En tecnología de redes, el mismo tipo de circuito temporal entre un L</cliente> y un L</servidor>.

source: In normal "computerese", the piece of data of the size most efficiently handled by your computer, typically 32 bits or so, give or take a few powers of 2.
es: En lenguaje informático normal, fragmento de datos del tamaño procesado de forma más eficiente por el equipo, normalmente 32 bits, quitando o sumando algunas potencias de 2.

source: In object-oriented code, we often find that one object references another object.
es: Es habitual en el código orientado a objetos que un objeto contenga referencias a otro objeto.

source: In olden days, the act of looking up a L</key> in an actual index (such as a phone book), but now merely the act of using any kind of key or position to find the corresponding L</value>, even if no index is involved.
es: Antiguamente era el acto de buscar una L</clave> en un índice real (como un listín telefónico), pero actualmente no es más que el acto de usar cualquier tipo de clave o posición para buscar el L</valor> correspondiente, aunque no exista un índice.

source: In order to make it more robust it is recommended to start every program with the following lines:
es: Sin embargo, para trabajar de manera más segura se recomienda iniciar cada programa con las líneas siguientes:

source: In order to understand Perl objects, you first need to understand references in Perl.
es: Antes de comprender cómo funcionan los objetos en Perl debe conocer el concepto de referencia.

source: In other words, C<*FH> must be used to create new symbol table entries; C<*foo{THING}> cannot.
es: Es decir, se debe usar C<*ARCHIVO> para crear nuevas entradas en la tabla de símbolos; no se puede hacer con C<*foo{COSA}>.

source: In other words, Perl can resolve the syntax as either C<< File->new( $path, $data ) >> B<or> C<< new( File( $path, $data ) ) >>.
es: Es decir, Perl puede resolver la sintaxis como C<< Archivo->new( $ruta, $datos ) >> B<o> como C<< new( Archivo( $ruta, $datos ) ) >>.

source: In other words, Perl overloads certain operations based on whether the expected return value is singular or plural.
es: Es decir, Perl sobrecarga ciertas operaciones basándose en si el valor de retorno esperado es singular o plural.

source: In other words, a pattern such as C<((?i)(?&NAME))> does not change the case-sensitivity of the "NAME" pattern.
es: Es decir, un patrón como C<((?i)(&NOMBRE))> no hace que el patrón "NOMBRE" distinga mayúsculas de minúsculas.

source: In other words, it does not check the full recursion stack.
es: Es decir, no comprueba toda la pila de recursión.

source: In other words, it must match C</^[_A-Za-z][_A-Za-z0-9]*\z/> or its Unicode extension (see L), though it isn't extended by the locale (see L<perllocale>).
es: Es decir, debe coincidir con C</^[_A-Za-z][_A-Za-z0-9]*\z/> o su extensión Unicode (vea L), pero no se amplia mediante la configuración regional (vea L<perllocale>).

source: In other words, once the C<(*COMMIT)> has been entered, and if the pattern does not match, the regex engine will not try any further matching on the rest of the string.
es: Es decir, cuando se entra en C<(*COMMIT)>, y si el patrón no coincide, el motor de expresiones regulares no tratará de encontrar nada más en el resto de la cadena.

source: In other words, the two zero-width assertions next to each other work as though they're ANDed together, just as you'd use any built-in assertions: C</^$/> matches only if you're at the beginning of the line AND the end of the line simultaneously.
es: Es decir, las dos aserciones de ancho cero, una junto a la otra, funcionan como si estuvieran unidas por una conjunción Y, como si se hubieran usando aserciones predefinidas: C</^$/> solo coincide si está simultáneamente al comienzo de la línea Y al final de la línea.

source: In other words, you should make sure your work is committed against the current position of blead, so that you can push back to the master repository without merging.
es: Es decir, debe asegurarse de confirmar su trabajo en la posición actual de blead, para poder enviar los cambios al repositorio principal sin tener que combinar.

source: In other words: don't try to find out what the internal encoding for a certain string is, but instead just encode it into the encoding that you want.
es: En resumen: no intente averiguar cuál es la codificación interna de una cadena determinada; solo tiene que codificarla con la codificación que desee.

source: In our example, C<$myarray[-1]> would have been 5000, and C<$myarray[-2]> would have been 500.
es: En nuestro ejemplo, C<$miarray[-1]> es 5000 y C<$miarray[-2]> es 500.

source: In particular the following metacharacters have their standard I<egrep>-ish meanings: X<metacharacter> X<\> X<^> X<.> X<$> X<|> X<(> X<()> X<[> X<[]>
es: En particular, los siguientes metacaracteres mantienen sus significados estándar heredados de C<egrep>: X<metacarácter> X<\> X<^> X<.> X<$> X<|> X<(> X<()> X<[> X<[]>

source: In particular, C<a*> inside C<a*ab> will match fewer characters than a standalone C<a*>, since this makes the tail match.
es: En particular, C<a*> dentro de C<a*ab> coincidirá con menos caracteres que el patrón C<a*> independiente, para permitir que el resto del patrón coincida.

source: In particular, bugs/features of the compiler used may lead to breakage of some of the above rules.
es: En particular, determinados errores o características del compilador usado pueden provocar la infracción de algunas de las normas anteriores.

source: In particular, rounding is strongly biased to 0, though a number like C<"0.99999999999999999999"> has a chance of being rounded to 1.
es: En particular, hay un sesgo muy fuerte de redondeo a 0, aunque es posible que un número como C<"0.99999999999999999999"> se redondee a 1.

source: In particular, the core development team (known as the Perl Porters) are a rag-tag band of highly altruistic individuals committed to producing better software for free than you could hope to purchase for money.
es: En concreto, el núcleo del equipo de desarrollo (denominado Perl Porters) está integrado por un grupo variopinto de personas de gran altruismo, dedicadas a producir gratuitamente software de mejor calidad que el que se podría obtener pagando.

source: In particular, the lower quantifier bound is not optional.
es: En particular, el cuantificador de límite inferior no es opcional.

source: In perl 5.12.x and earlier, because the regex engine was not re-entrant, delayed code could not safely invoke the regex engine either directly with C<m//> or C<s///>), or indirectly with functions such as C<split>.
es: En perl 5.12.x y versiones anteriores no había reentrada en el motor de expresiones regulares, por lo que el código interpolado no podía invocar de forma segura el motor de expresiones regulares directamente con C<m//> o C<s///>, o indirectamente a través de funciones, como C<split>.

source: In practice, it's best to consider an object's internal data structure opaque.
es: En la práctica es mejor considerar opaca la estructura interna de los objetos.

source: In reality, subclassing sometimes involves violating encapsulation, but a good API can minimize the need to do this.
es: En realidad, a veces la creación de subclases requiere infringir el principio de encapsulación, pero si la interfaz es buena, la posibilidad de que esto ocurra es mínima.

source: In scopes where C<use integer;> is in force, nearly all the operators listed above will force their argument(s) into integer format, and return an integer result.
es: En ámbitos en los que C<use integer;> está activo, casi todos los operadores indicados arriba forzarán la conversión de sus argumentos a formato de entero, y devolverán un resultado entero.

source: In short, Perl 4 is the past, Perl 5 is the present, and Perl 6 is the future.
es: Se puede resumir de la siguiente manera: Perl 4 es el pasado, Perl 5 es el presente y Perl 6 es el futuro.

source: In simple terms, "C3" order ensures that shared parent classes are never searched before child classes, so Perl will now search: C<Child>, C<Father>, C<PaternalGrandparent>, C<Mother> C<MaternalGrandparent>, and finally C<SharedGreatGrandParent>.
es: A grandes rasgos, el orden "C3" garantiza que no se exploren las clases primarias comunes antes de buscar en las clases derivadas, de forma que el orden de búsqueda será ahora: C<Hijo>, C<Padre>, C<AbueloPaterno>, C<Madre>, C<AbueloMaterno> y, por último, C<BisabueloComún>.

source: In some cases perfection has been sacrificed in the goal of getting the general idea across.
es: En algunos casos se ha sacrificado la precisión para transmitir la idea general.

source: In some cases, it may be a chain of identifiers, separated by C<::> (or by the slightly archaic C<'>); all but the last are interpreted as names of packages, to locate the namespace in which to look up the final identifier (see L<perlmod/Packages> for details).
es: En ciertos casos, puede ser una serie de identificadores separados por C<::> (o por el separador C<'>, algo anticuado), donde todos los identificadores menos el último se interpretan como nombres de paquetes que determinan el espacio de nombres en el que se buscará el identificador final (encontrará más detalles en la sección "Paquetes" de L<perlmod>).

source: In some cases, the use of C<(*PRUNE)> can be replaced with a C<< (?>pattern) >> with no functional difference; however, C<(*PRUNE)> can be used to handle cases that cannot be expressed using a C<< (?>pattern) >> alone.
es: En algunos casos, se puede reemplazar el uso de C<(*PRUNE)> por C<< (?>patrón) >> sin ninguna diferencia funcional; sin embargo, C<(*PRUNE)> permite controlar casos que no se pueden expresar con una única construcción C<< (?>patrón) >>.

source: In some literature this construct is called "atomic matching" or "possessive matching".
es: En algunos artículos sobre el tema, esta construcción se denomina "detección de coincidencias atómica" o "detección de coincidencias posesiva".

source: In some operating systems (like Unix), you can give certain file access permissions to other members of your group.
es: En algunos sistemas operativos (como Unix) puede asignar determinados permisos de acceso a archivos a otros miembros de su grupo.

source: In telephony, the temporary electrical circuit between the caller's and the callee's phone.
es: En telefonía, es el circuito eléctrico temporal que se establece entre el teléfono que hace la llamada y el que la recibe.

source: In that case, it's easy to use C<require> instead.
es: En este caso debe usarse C<require>.

source: In the above example, it's not clear if C<save> is a method provided by the C<File> class or simply a subroutine that expects a file object as its first argument.
es: En el ejemplo anterior no está claro si C<guardar> es un método proporcionado por la clase C<Archivo> o simplemente una subrutina que espera un objeto archivo como primer argumento.

source: In the absence of that stricture, a bareword is treated as if quotes were around it.
es: Si no se usa este pragma, se tratará la palabra como si estuviera escrita entre comillas.

source: In the book, Randal Schwartz capitalised the language's name to make it stand out better when typeset.
es: En el libro, Randal Schwartz escribió el nombre del lenguaje con inicial mayúscula para que destacara más en la composición tipográfica.

source: In the case of single inheritance, Perl simply looks up the inheritance chain to find a method:
es: En el caso de la herencia simple, Perl simplemente busca en la cadena de herencia para encontrar el método:

source: In the context of the L<stat(2)> syscall, refers to the field holding the L</permission bits> and the type of the L</file>.
es: En el contexto de la llamada de sistema L<stat(2)>, se refiere al campo que contiene los L</bits de permiso> y el tipo del L</archivo>.

source: In the description below C<S> and C<T> are regular subexpressions.
es: En la siguiente descripción, C<S> y C<T> son subexpresiones regulares.

source: In the example above, you can see that we passed C<< isa => 'Bool' >> to C<has()> when creating our C<is_on> attribute.
es: En el ejemplo anterior se aprecia que se pasa un valor C<< isa => 'Bool' >> a C<has()> al crear el atributo C<encendido>.

source: In the example pragma, retrieval is encapsulated into the routine C<in_effect()>, which takes as parameter the number of call frames to go up to find the value of the pragma in the user's script.
es: En el pragma de ejemplo, la recuperación se encapsula en la rutina C<in_effect()>, que usa como parámetro el número de marcos de llamadas que hay que subir para encontrar el valor del pragma en el script del usuario.

source: In the first case, any double colons in the module name, such as C<Some::Module>, are translated into your system's directory separator, usually "/".
es: En el primer caso, si el nombre del módulo contiene el símbolo "::" (por ejemplo, C<Mi::Modulo>), dicho símbolo se traducirá como el separador de directorios habitual (generalmente "/").

source: In the first form, the anonymous hash is being blessed into the class in C<$class>.
es: En la primera forma, el hash anónimo se bendice en la clase especificada por el nombre de clase almacenado en C<$clase>.

source: In the first two versions, the body of the subroutine is lexically in the main package, I<not> in Some_package.
es: En las dos primeras versiones, el cuerpo de la subrutina se define en el paquete C<main>, I<no> en Un_paquete.

source: In the following table, C<c> is a C<char>, and C<u> is a Unicode codepoint.
es: En la tabla siguiente, C<c> es un C<char> y C<u> es un código de carácter Unicode.

source: In the following tables:
es: En las tablas siguientes:

source: In the past, people just bit the bullet and used multiple inheritance.
es: En el pasado, los programadores tenían que resignarse a usar herencia múltiple.

source: In the past, the Perl community experimented with a technique called "inside-out objects".
es: En el pasado, la comunidad Perl experimentó con una técnica llamada "objetos I<inside-out>".

source: In the previous examples, the C<{}> code creates a reference to an empty anonymous hash.
es: En los ejemplos anteriores, el código C<{}> crea una referencia a un hash anónimo vacío.

source: In the realm of hackerdom, a listing of the differences between two versions of a program as might be applied by the I<patch>(1) program when you want to fix a bug or upgrade your old version.
es: En el mundo hacker, un parche es una lista de diferencias entre dos versiones de un programa como las que se pueden aplicar mediante el programa I<patch>(1) cuando se desea corregir un error o actualizar una versión antigua.

source: In the second form, the anonymous hash is blessed into the current package.
es: En la segunda forma, el hash anónimo se bendice en el paquete actual.

source: In the simplest case, the C<$class> variable will end up containing the string "File".
es: En el caso más simple la variable C<$clase> contendrá la cadena "Archivo".

source: In theory C<Strtol> and C<Strtoul> may not be defined if the machine perl is built on doesn't actually have strtol and strtoul.
es: En teoría, C<Strtol> y C<Strtoul> no se pueden definir si el equipo en el que se ha compilado perl no dispone de strtol y strtoul.

source: In these cases perl will fall back to the old behaviour of using C's argv[0] value for C<$^X>.
es: En estos casos, perl vuelve al comportamiento anterior (utilizar el valor argv[0] de C como valor de C<$^X>).

source: In this case, we have to advance C<patcopy> along with C<pat> when we see spaces:
es: En este caso, tenemos que incrementar C<patcopy> junto con C<pat> cuando veamos espacios:

source: In this book, we call any piece of standard Perl documentation (like I<perlop> or I<perldelta>) a manpage, no matter what format it's installed in on your system.
es: En este libro llamamos página de manual a cualquier archivo de documentación estándar de Perl (como I<perlop> o I<perldelta>), independientemente del formato con el que se haya instalado en el sistema.

source: In this case, it finds a C<save()> method in the C<File> class.
es: En este caso se encuentra un método C<guardar()> en la clase C<Archivo>.

source: In this case, the yes-pattern is never directly executed, and no no-pattern is allowed.
es: En este caso, el patrón-sí no se ejecuta nunca directamente y no se permite un patrón-no.

source: In this example, we will get the following output:
es: En este ejemplo se obtiene el siguiente resultado:

source: In those cases where C<HvENAME()> returns null, C<HvNAME()> should be used instead.
es: En aquellos casos en los que C<HvENAME()> devuelva un valor nulo, se debe usar C<HvNAME()> en su lugar.

source: In your ~/git/perl repository, set the destination email to perl's bug tracker:
es: En su repositorio ~/git/perl, establezca como dirección de correo de destino la del sistema de seguimiento de errores de perl:

source: Included in the official Perl distribution, as in a standard module, a standard tool, or a standard Perl L</manpage>.
es: Incluido en la distribución de Perl oficial como un módulo estándar, una herramienta estándar o una L</página de manual> de Perl estándar.

source: Incoming, the firewall tries to detect attacks and blocks IP addresses with suspicious activity.
es: Para la entrada, el firewall trata de detectar ataques y bloquea las direcciones IP con actividad sospechosa.
